[["6dAltf", "a1-2", "6dAltf", "b1-2", "6dAltf"], ["6dAltf", "b1-2", "6dAltf", "a1-2", "6dAltf"], ["6dAltf", "b1-3", "6dAltf", "a1-2", "6dAltf"], ["6dTal", "a1-2", "Rha", "a1-2", "6dTal"], ["6dTal", "a1-2", "Rha", "a1-5", "Sug"], ["6dTal", "a1-3", "6dTal", "a1-2", "Rha"], ["6dTal", "a1-3", "6dTalOAc", "a1-2", "RhaOMe"], ["6dTal", "a1-3", "GalNAc", "b1-3", "6dTal"], ["6dTalNAcOAc", "b1-4", "FucNAc", "a1-4", "FucNAc"], ["6dTalOAc", "a1-2", "6dTal", "a1-3", "6dTalOAc"], ["6dTalOAc", "a1-2", "Araf", "a1-6", "GlcNAc"], ["6dTalOAc", "a1-2", "RhaOMe", "a1-2", "6dTal"], ["6dTalOAc", "a1-3", "Fuc", "a1-4", "Glc"], ["6dTalOAc", "a1-3", "Fuc", "a1-6", "Glc"], ["6dTalOAc", "a1-3", "FucNAc", "a1-2", "LDManHep"], ["6dTalOAc", "a1-3", "FucNAc", "b1-4", "QuiNAc"], ["6dTalOAc", "a1-3", "Gal", "b1-7", "Kdo"], ["6dTalOAc", "a1-3", "GalNAc", "b1-4", "Man"], ["6dTalOAc", "a1-3", "GlcNAc", "a1-7", "Kdo"], ["6dTalOAc", "a1-3", "Man", "a1-2", "Man"], ["6dTalOAc", "a1-3", "Man", "a1-3", "6dTalOAc"], ["6dTalOAcOMe", "a1-3", "FucOAc", "a1-3", "QuiNAc"], ["6dTalOMe", "a1-3", "FucOMe", "a1-4", "GlcOMeA"], ["Abe", "a1-3", "LDManHep", "b1-4", "Gal"], ["Abe", "a1-3", "Man", "a1-2", "Man"], ["Abe", "a1-3", "Man", "a1-3", "Fuc"], ["Abe", "a1-3", "Man", "a1-4", "Rha"], ["Abe", "a1-3", "Rha", "b1-2", "Man"], ["Abe", "a1-3", "RhaOAc", "b1-2", "Man"], ["AbeOAc", "a1-3", "Man", "a1-4", "Rha"], ["AltNAcA", "a1-3", "FucNAc", "b1-4", "AltNAcA"], ["Altf", "a1-3", "Fuc", "a1-3", "Man"], ["Altf", "a1-3", "Man", "b1-4", "Man"], ["AltfOAc", "b1-2", "AltfOAc", "b1-3", "Altf"], ["AltfOAc", "b1-3", "Altf", "b1-2", "AltfOAc"], ["Ara", "a1-3", "Gal", "b1-4", "Ara"], ["Ara", "a1-3", "Gal", "b1-4", "Gal"], ["Ara", "a1-3", "Xyl", "b1-4", "Xyl"], ["Ara", "a1-5", "Ara", "a1-3", "Gal"], ["Ara", "b1-3", "Ara", "b1-6", "Gal"], ["Ara", "b1-6", "Gal", "b1-3", "Ara"], ["Ara", "b1-6", "Gal", "b1-3", "Gal"], ["AraN", "b1-7", "LDManHep", "a1-5", "Kdo"], ["Araf", "a1-3", "GlcNAc", "a1-4", "GalNAc"], ["Araf", "a1-6", "GlcNAc", "b1-3", "6dTalOAc"], ["Asc", "a1-3", "DDManHep", "a1-4", "FucNAc"], ["Asc", "a1-3", "Fuc", "a1-3", "Man"], ["Col", "a1-2", "Gal", "b1-3", "Col"], ["Col", "a1-2", "Gal", "b1-3", "GlcAN"], ["Col", "a1-2", "Gal", "b1-3", "GlcNAc"], ["Col", "a1-2", "GalOAcA", "b1-3", "Col"], ["Col", "a1-2", "Glc", "b1-3", "GalNAc"], ["Col", "a1-2", "Sug", "b1-3", "GalNAc"], ["Col", "a1-3", "Col", "a1-6", "Glc"], ["Col", "a1-4", "Col", "a1-2", "Gal"], ["Col", "a1-4", "GlcNAc", "a1-4", "GalA"], ["Col", "a1-4", "GlcNAc", "b1-4", "GalA"], ["Col", "a1-4", "GlcNAc", "b1-4", "Rha"], ["Col", "a1-6", "Glc", "a1-4", "Gal"], ["DDGalHep", "a1-2", "Rha", "a1-4", "DDGalHep"], ["DDGalHep", "b1-3", "GlcNAc", "a1-4", "DDGalHep"], ["DDManHep", "a1-2", "LDManHep", "a1-4", "LDManHep"], ["DDManHep", "a1-4", "FucNAc", "a1-3", "QuiNAc"], ["DDManHep", "a1-7", "LDManHep", "a1-3", "LDManHep"], ["DDManHep", "b1-3", "GlcNAc", "b1-7", "DDManHep"], ["DDManHep", "b1-3", "LDManHepOAc", "b1-4", "Rha"], ["Dha", "a2-3", "GalA", "a1-3", "Glc"], ["Fruf", "b2-4", "Glc", "b1-4", "GalA"], ["Fuc", "a1-2", "Gal", "a1-2", "Fuc"], ["Fuc", "a1-2", "Gal", "a1-3", "Gal"], ["Fuc", "a1-2", "Gal", "a1-3", "GalNAc"], ["Fuc", "a1-2", "Gal", "b1-2", "Xyl"], ["Fuc", "a1-2", "Gal", "b1-3", "Fuc"], ["Fuc", "a1-2", "Gal", "b1-3", "Gal"], ["Fuc", "a1-2", "Gal", "b1-3", "GalNAc"], ["Fuc", "a1-2", "Gal", "b1-3", "GlcNAc"], ["Fuc", "a1-2", "Gal", "b1-3", "NeuNAc"], ["Fuc", "a1-2", "Gal", "b1-4", "Fuc"], ["Fuc", "a1-2", "Gal", "b1-4", "Glc"], ["Fuc", "a1-2", "Gal", "b1-4", "GlcNAc"], ["Fuc", "a1-2", "Gal", "b1-4", "GlcNAcOS"], ["Fuc", "a1-2", "GalNAc", "a1-3", "Gal"], ["Fuc", "a1-2", "GalNAc", "b1-3", "Rha"], ["Fuc", "a1-2", "Glc", "a1-3", "GlcNAc"], ["Fuc", "a1-2", "Glc", "b1-3", "GlcNAcOAc"], ["Fuc", "a1-2", "GlcOAcA", "b1-3", "GalNAc"], ["Fuc", "a1-2", "Man", "a1-2", "Fuc"], ["Fuc", "a1-2", "NeuNAc", "a2-6", "Gal"], ["Fuc", "a1-2", "Rha", "a1-3", "Fuc"], ["Fuc", "a1-2", "Rha", "a1-3", "ManOAc"], ["Fuc", "a1-3", "Fuc", "a1-6", "GlcNAc"], ["Fuc", "a1-3", "FucNAc", "b1-4", "Fuc"], ["Fuc", "a1-3", "Gal", "a1-6", "GlcNAc"], ["Fuc", "a1-3", "Gal", "b1-4", "Glc"], ["Fuc", "a1-3", "Gal", "b1-4", "GlcNAc"], ["Fuc", "a1-3", "Gal", "b1-4", "GlcNAcOS"], ["Fuc", "a1-3", "GalNAc", "a1-2", "Fuc"], ["Fuc", "a1-3", "GalNAc", "a1-2", "Man"], ["Fuc", "a1-3", "GalNAc", "a1-2", "QuiNAc"], ["Fuc", "a1-3", "GalNAc", "a1-6", "ManOAc"], ["Fuc", "a1-3", "GalNAc", "b1-2", "Man"], ["Fuc", "a1-3", "GalNAc", "b1-4", "GlcNAc"], ["Fuc", "a1-3", "GalOS", "b1-4", "GlcNAc"], ["Fuc", "a1-3", "Glc", "a1-4", "Qui"], ["Fuc", "a1-3", "Glc", "a1-6", "GlcNAc"], ["Fuc", "a1-3", "Glc", "b1-4", "GalNAc"], ["Fuc", "a1-3", "GlcNAc", "a1-2", "Man"], ["Fuc", "a1-3", "GlcNAc", "b1-2", "Man"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "Fuc"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "Gal"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "GalNAc"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "Glc"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "GlcNAc"], ["Fuc", "a1-3", "GlcNAc", "b1-3", "NeuNAc"], ["Fuc", "a1-3", "GlcNAc", "b1-4", "Fuc"], ["Fuc", "a1-3", "GlcNAc", "b1-4", "Glc"], ["Fuc", "a1-3", "GlcNAc", "b1-4", "Man"], ["Fuc", "a1-3", "GlcNAc", "b1-4", "NeuNAc"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "Fuc"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "Gal"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "GalOS"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "GlcNAc"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "GlcNAcOS"], ["Fuc", "a1-3", "GlcNAc", "b1-6", "NeuNAc"], ["Fuc", "a1-3", "GlcNAcOS", "b1-3", "Gal"], ["Fuc", "a1-3", "GlcNAcOS", "b1-6", "NeuNAc"], ["Fuc", "a1-3", "Man", "a1-2", "Fuc"], ["Fuc", "a1-3", "Man", "a1-3", "QuiNAc"], ["Fuc", "a1-3", "Man", "a1-4", "Fuc"], ["Fuc", "a1-3", "Man", "b1-3", "Man"], ["Fuc", "a1-3", "Rha", "a1-2", "Fuc"], ["Fuc", "a1-3", "Rha", "a1-3", "Fuc"], ["Fuc", "a1-4", "Fuc", "a1-2", "Glc"], ["Fuc", "a1-4", "Gal", "b1-3", "GlcNAc"], ["Fuc", "a1-4", "GalNAc", "b1-3", "Fuc"], ["Fuc", "a1-4", "GalOS", "b1-3", "GlcNAc"], ["Fuc", "a1-4", "Glc", "b1-3", "6dTalOAc"], ["Fuc", "a1-4", "Glc", "b1-3", "GalNAc"], ["Fuc", "a1-4", "Glc", "b1-3", "Glc"], ["Fuc", "a1-4", "GlcN", "a1-4", "GlcA"], ["Fuc", "a1-4", "GlcNAc", "a1-3", "Fuc"], ["Fuc", "a1-4", "GlcNAc", "b1-3", "Fuc"], ["Fuc", "a1-4", "GlcNAc", "b1-3", "Gal"], ["Fuc", "a1-4", "GlcNAc", "b1-3", "NeuNAc"], ["Fuc", "a1-4", "GlcNAc", "b1-6", "Gal"], ["Fuc", "a1-4", "GlcNAc", "b1-6", "GalNAc"], ["Fuc", "a1-4", "GlcNAc", "b1-6", "GlcNAc"], ["Fuc", "a1-4", "GlcOAc", "b1-3", "GalNAc"], ["Fuc", "a1-6", "Fuc", "a1-3", "GlcNAc"], ["Fuc", "a1-6", "Gal", "b1-4", "GlcNAc"], ["Fuc", "a1-6", "Glc", "a1-3", "GlcNAc"], ["Fuc", "a1-6", "GlcNAc", "b1-4", "GlcNAc"], ["FucN", "a1-3", "QuiNAcNBut", "a1-3", "Rha"], ["FucNAc", "a1-2", "QuiNAc", "b1-3", "FucNAc"], ["FucNAc", "a1-2", "QuiNBut", "b1-2", "Rha"], ["FucNAc", "a1-2", "Rha", "a1-2", "Rha"], ["FucNAc", "a1-2", "Rha", "a1-3", "FucNAc"], ["FucNAc", "a1-2", "Rha", "b1-3", "Rha"], ["FucNAc", "a1-2", "Rha", "b1-3", "RhaNAc"], ["FucNAc", "a1-3", "FucNAc", "a1-3", "Glc"], ["FucNAc", "a1-3", "FucNAc", "a1-3", "QuiNAc"], ["FucNAc", "a1-3", "Glc", "a1-2", "Rha"], ["FucNAc", "a1-3", "Glc", "a1-4", "GlcNAc"], ["FucNAc", "a1-3", "Glc", "a1-6", "GlcNAc"], ["FucNAc", "a1-3", "Glc", "b1-4", "GlcNAc"], ["FucNAc", "a1-3", "GlcNAc", "a1-4", "GlcNAc"], ["FucNAc", "a1-3", "GlcNAc", "a1-4", "LegOAc"], ["FucNAc", "a1-3", "GlcNAc", "b1-2", "Gal"], ["FucNAc", "a1-3", "GlcNAc", "b1-2", "P1Gro-Glc"], ["FucNAc", "a1-3", "GlcNAc", "b1-3", "GalNAcA"], ["FucNAc", "a1-3", "GlcNAc", "b1-4", "GlcNAc"], ["FucNAc", "a1-3", "ManNAcA", "b1-3", "QuiNAc"], ["FucNAc", "a1-3", "QuiNAc", "a1-3", "FucNAc"], ["FucNAc", "a1-3", "QuiNAc", "b1-2", "DDManHep"], ["FucNAc", "a1-3", "QuiNAc", "b1-3", "FucNAc"], ["FucNAc", "a1-3", "QuiNAcNBut", "b1-4", "FucNAc"], ["FucNAc", "a1-4", "Fuc", "a1-3", "GlcNAc"], ["FucNAc", "a1-4", "FucNAc", "a1-3", "6dTalNAcOAc"], ["FucNAc", "a1-4", "Gal", "b1-4", "Glc"], ["FucNAc", "a1-4", "GalA", "a1-3", "FucNAc"], ["FucNAc", "a1-4", "GalNAcA", "a1-3", "FucNAc"], ["FucNAc", "a1-4", "Glc", "a1-3", "Glc"], ["FucNAc", "a1-4", "QuiNAc", "a1-3", "QuiNAc"], ["FucNAc", "b1-6", "Glc", "a1-4", "GalNAc"], ["FucNAcA", "a1-3", "QuiNAc", "a1-2", "Rha"], ["FucNAcOAc", "a1-4", "Glc", "b1-6", "GalNAc"], ["FucNAcOAc", "b1-3", "GlcNAcOPyr", "a1-4", "Gal"], ["FucNAm", "a1-3", "GlcNAc", "a1-2", "Gal"], ["FucNAm", "a1-3", "GlcNAc", "a1-4", "GlcNAcOAc"], ["FucNAm", "a1-3", "GlcNAc", "b1-4", "GlcNAc"], ["FucNAm", "a1-3", "GlcNAc", "b1-4", "NeuNAcOAc"], ["FucNAm", "a1-3", "GlcNAcOAc", "b1-7", "NeuNAc"], ["FucNAm", "a1-3", "QuiNAcNBut", "b1-4", "Glc"], ["FucNBut", "a1-4", "Gal", "a1-4", "GalNAc"], ["FucNBut", "a1-4", "Gal", "a1-4", "GulNAcA"], ["FucNBut", "b1-3", "GalNAc", "a1-3", "GalNAc"], ["FucNBut", "b1-6", "GlcNAc", "a1-4", "Glc"], ["FucNFo", "a1-3", "Man", "b1-3", "Glc"], ["FucNFo", "a1-4", "GalA", "a1-4", "GalNAc"], ["FucNProp", "a1-4", "GalNAc", "b1-4", "Gal"], ["FucNThrAc", "a1-3", "ManNAcA", "b1-4", "GalNAc"], ["FucOAc", "a1-3", "QuiNAc", "a1-4", "GlcNAmA"], ["FucOAc", "a1-3", "Ribf", "b1-4", "Fuc"], ["FucOAcNAm", "a1-3", "QuiNAc", "a1-4", "GlcNAcNButA"], ["FucOAcNAm", "a1-3", "Sug", "a1-4", "GlcNAcOAcA"], ["FucOAcNBut", "b1-6", "GlcNAc", "a1-4", "Glc"], ["Fucf", "a1-4", "Rha", "a1-3", "Rha"], ["Gal", "a1-2", "Fuc", "a1-3", "Galf"], ["Gal", "a1-2", "Fuc", "a1-3", "GlcA"], ["Gal", "a1-2", "Gal", "a1-2", "Glc"], ["Gal", "a1-2", "Gal", "a1-4", "Glc"], ["Gal", "a1-2", "Glc", "b1-3", "Glc"], ["Gal", "a1-2", "Rha", "a1-2", "Ribf"], ["Gal", "a1-2", "Ribf", "b1-4", "Gal"], ["Gal", "a1-3", "DDManHep", "a1-5", "KdoN"], ["Gal", "a1-3", "Fuc", "a1-2", "Gal"], ["Gal", "a1-3", "Fuc", "a1-4", "GlcNAc"], ["Gal", "a1-3", "FucNAc", "a1-3", "Glc"], ["Gal", "a1-3", "Gal", "a1-3", "DDManHep"], ["Gal", "a1-3", "Gal", "a1-3", "Gal"], ["Gal", "a1-3", "Gal", "a1-4", "Gal"], ["Gal", "a1-3", "Gal", "b1-3", "Gal"], ["Gal", "a1-3", "Gal", "b1-3", "GalNAc"], ["Gal", "a1-3", "Gal", "b1-3", "Glc"], ["Gal", "a1-3", "Gal", "b1-3", "GlcNAc"], ["Gal", "a1-3", "Gal", "b1-3", "GlcNAcOS"], ["Gal", "a1-3", "Gal", "b1-4", "GalNAc"], ["Gal", "a1-3", "Gal", "b1-4", "GlcNAc"], ["Gal", "a1-3", "GalA", "a1-3", "GlcNAc"], ["Gal", "a1-3", "GalNAc", "a1-4", "Man"], ["Gal", "a1-3", "GalNAc", "b1-3", "Gal"], ["Gal", "a1-3", "GalNAc", "b1-4", "Glc"], ["Gal", "a1-3", "GalNAc", "b1-6", "Glc"], ["Gal", "a1-3", "GalNAc", "b1-6", "GlcNAc"], ["Gal", "a1-3", "GalNAc", "b1-6", "GlcOAc"], ["Gal", "a1-3", "Galf", "b1-3", "Gal"], ["Gal", "a1-3", "GalfOAc", "b1-3", "Gal"], ["Gal", "a1-3", "Glc", "a1-3", "GalA"], ["Gal", "a1-3", "Glc", "a1-3", "GlcNAc"], ["Gal", "a1-3", "Glc", "b1-4", "GlcOAc"], ["Gal", "a1-3", "GlcA", "b1-3", "GalNAc"], ["Gal", "a1-3", "GlcNAc", "a1-2", "Rha"], ["Gal", "a1-3", "GlcNAc", "b1-2", "Glc"], ["Gal", "a1-3", "GlcNAc", "b1-3", "Gal"], ["Gal", "a1-3", "GlcNAc", "b1-3", "QuiNBut"], ["Gal", "a1-3", "GlcNAc", "b1-3", "Rha"], ["Gal", "a1-3", "GlcNAc", "b1-4", "Glc"], ["Gal", "a1-3", "GlcNAc", "b1-6", "GlcNAc"], ["Gal", "a1-3", "GlcNAcOAc", "b1-2", "Rha"], ["Gal", "a1-3", "GlcNAcOAc", "b1-4", "FucNAm"], ["Gal", "a1-3", "LDManHep", "a1-7", "LDManHep"], ["Gal", "a1-3", "ManNAc", "b1-6", "GalfOAc"], ["Gal", "a1-3", "NeuNAc", "a2-6", "GalNAc"], ["Gal", "a1-3", "Rha", "a1-3", "Rha"], ["Gal", "a1-3", "RhaOAc", "a1-4", "Glc"], ["Gal", "a1-4", "Gal", "b1-3", "GalNAc"], ["Gal", "a1-4", "Gal", "b1-3", "Glc"], ["Gal", "a1-4", "Gal", "b1-3", "GlcNAc"], ["Gal", "a1-4", "Gal", "b1-4", "Glc"], ["Gal", "a1-4", "Gal", "b1-4", "GlcNAc"], ["Gal", "a1-4", "GalNAc", "a1-3", "FucNAc"], ["Gal", "a1-4", "GalNAc", "b1-3", "Gal"], ["Gal", "a1-4", "GalNAc", "b1-3", "GalNAc"], ["Gal", "a1-4", "GalNAc", "b1-4", "GlcASer"], ["Gal", "a1-4", "Glc", "a1-2", "Man"], ["Gal", "a1-4", "Glc", "a1-3", "GalA"], ["Gal", "a1-4", "Glc", "b1-3", "GalNAc"], ["Gal", "a1-4", "GlcNAc", "b1-3", "GalNAc"], ["Gal", "a1-4", "GulNAcA", "a1-4", "GlcNAcOAc"], ["Gal", "a1-4", "Rha", "a1-3", "GlcNAc"], ["Gal", "a1-5", "Kdo", "a1-4", "Kdo"], ["Gal", "a1-6", "Gal", "a1-3", "Gal"], ["Gal", "a1-6", "Gal", "a1-4", "Glc"], ["Gal", "a1-6", "Gal", "b1-3", "FucNAc"], ["Gal", "a1-6", "Gal", "b1-3", "GalNAc"], ["Gal", "a1-6", "GalA", "a1-4", "Man"], ["Gal", "a1-6", "GalNAc", "a1-4", "GalNAc"], ["Gal", "a1-6", "GalNAc", "a1-4", "Glc"], ["Gal", "a1-6", "Galf", "b1-6", "Galf"], ["Gal", "a1-6", "Glc", "a1-4", "RhaOPEtn"], ["Gal", "a1-6", "Glc", "b1-3", "GalNAc"], ["Gal", "a1-6", "Glc", "b1-3", "Galf"], ["Gal", "a1-6", "Glc", "b1-6", "GlcNAc"], ["Gal", "a1-6", "GlcNAc", "a1-3", "GalNAc"], ["Gal", "a1-6", "GlcNAc", "a1-4", "GalA"], ["Gal", "a1-6", "GlcNAc", "a1-4", "GalNAc"], ["Gal", "a1-6", "GlcNAc", "b1-3", "Gal"], ["Gal", "a1-6", "LDManHep", "a1-6", "Glc"], ["Gal", "a1-6", "Man", "b1-4", "Gal"], ["Gal", "a1-6", "Man", "b1-4", "Glc"], ["Gal", "a1-6", "Man", "b1-4", "Man"], ["Gal", "a1-7", "Kdo", "a1-2", "Glc"], ["Gal", "b1-2", "P1Gro-FucNAc", "b1-3", "GlcNAc"], ["Gal", "b1-2", "Xyl", "a1-6", "Glc"], ["Gal", "b1-3", "Ara", "b1-3", "Ara"], ["Gal", "b1-3", "Ara", "b1-6", "Gal"], ["Gal", "b1-3", "Col", "a1-4", "GlcNAc"], ["Gal", "b1-3", "Fuc", "a1-2", "Gal"], ["Gal", "b1-3", "Fuc", "a1-2", "GalNAc"], ["Gal", "b1-3", "Fuc", "a1-4", "GlcN"], ["Gal", "b1-3", "Fuc", "a1-4", "GlcNAc"], ["Gal", "b1-3", "FucNAc", "a1-2", "QuiNAc"], ["Gal", "b1-3", "FucNAc", "a1-3", "GlcNAc"], ["Gal", "b1-3", "Gal", "a1-3", "Gal"], ["Gal", "b1-3", "Gal", "b1-3", "GalNAc"], ["Gal", "b1-3", "Gal", "b1-4", "GlcNAc"], ["Gal", "b1-3", "Gal", "b1-4", "Xyl"], ["Gal", "b1-3", "Gal", "b1-6", "Gal"], ["Gal", "b1-3", "Gal", "b1-6", "GalNAc"], ["Gal", "b1-3", "GalNAc", "a1-3", "GalNAc"], ["Gal", "b1-3", "GalNAc", "a1-3", "GlcNAc"], ["Gal", "b1-3", "GalNAc", "a1-4", "Gal"], ["Gal", "b1-3", "GalNAc", "a1-4", "GalNAc"], ["Gal", "b1-3", "GalNAc", "b1-3", "Gal"], ["Gal", "b1-3", "GalNAc", "b1-4", "Gal"], ["Gal", "b1-3", "GalNAc", "b1-4", "GalNAc"], ["Gal", "b1-3", "GalNAc", "b1-4", "GlcNAc"], ["Gal", "b1-3", "GalNAc", "b1-4", "Kdo"], ["Gal", "b1-3", "GalNAc", "b1-4", "NeuNAc"], ["Gal", "b1-3", "GalNAc", "b1-4", "Rha"], ["Gal", "b1-3", "Glc", "a1-4", "GalNAc"], ["Gal", "b1-3", "Glc", "a1-6", "GalNAc"], ["Gal", "b1-3", "Glc", "b1-4", "GalNAc"], ["Gal", "b1-3", "GlcAN", "b1-6", "GlcNAc"], ["Gal", "b1-3", "GlcNAc", "a1-2", "Ribf"], ["Gal", "b1-3", "GlcNAc", "a1-3", "Gal"], ["Gal", "b1-3", "GlcNAc", "a1-3", "VioNAc"], ["Gal", "b1-3", "GlcNAc", "a1-4", "Rha"], ["Gal", "b1-3", "GlcNAc", "b1-2", "FucNAcOAc"], ["Gal", "b1-3", "GlcNAc", "b1-2", "Gal"], ["Gal", "b1-3", "GlcNAc", "b1-3", "Fuc"], ["Gal", "b1-3", "GlcNAc", "b1-3", "Gal"], ["Gal", "b1-3", "GlcNAc", "b1-3", "GalNAc"], ["Gal", "b1-3", "GlcNAc", "b1-3", "GalOS"], ["Gal", "b1-3", "GlcNAc", "b1-3", "GlcNAc"], ["Gal", "b1-3", "GlcNAc", "b1-3", "ManNAc"], ["Gal", "b1-3", "GlcNAc", "b1-3", "NeuNAc"], ["Gal", "b1-3", "GlcNAc", "b1-4", "Gal"], ["Gal", "b1-3", "GlcNAc", "b1-4", "GlcA"], ["Gal", "b1-3", "GlcNAc", "b1-4", "QuiNAc"], ["Gal", "b1-3", "GlcNAc", "b1-6", "Gal"], ["Gal", "b1-3", "GlcNAc", "b1-6", "GalNAc"], ["Gal", "b1-3", "GlcNAcOS", "b1-6", "GalNAc"], ["Gal", "b1-3", "Gul", "a1-2", "Gal"], ["Gal", "b1-3", "NeuAc", "a2-6", "GlcNAc"], ["Gal", "b1-3", "NeuNAc", "a2-3", "Gal"], ["Gal", "b1-3", "NeuNAc", "a2-6", "Fuc"], ["Gal", "b1-3", "NeuNAc", "a2-6", "Gal"], ["Gal", "b1-3", "NeuNAc", "a2-6", "GalNAc"], ["Gal", "b1-3", "NeuNAc", "a2-6", "GlcNAc"], ["Gal", "b1-3", "NeuNAc", "a2-8", "GlcNAc"], ["Gal", "b1-3", "NeuNAc", "a2-8", "NeuNAc"], ["Gal", "b1-4", "Ara", "a1-3", "Gal"], ["Gal", "b1-4", "Ara", "a1-5", "Ara"], ["Gal", "b1-4", "Fuc", "a1-3", "Gal"], ["Gal", "b1-4", "Fuc", "a1-3", "Glc"], ["Gal", "b1-4", "Fuc", "a1-3", "GlcNAc"], ["Gal", "b1-4", "Fuc", "a1-3", "GlcNAcOS"], ["Gal", "b1-4", "Gal", "a1-6", "Glc"], ["Gal", "b1-4", "Gal", "a1-6", "LDManHep"], ["Gal", "b1-4", "Gal", "b1-3", "GalNAc"], ["Gal", "b1-4", "Gal", "b1-4", "Ara"], ["Gal", "b1-4", "Gal", "b1-4", "Gal"], ["Gal", "b1-4", "Gal", "b1-4", "GlcNAc"], ["Gal", "b1-4", "Gal", "b1-7", "LDManHep"], ["Gal", "b1-4", "Gal", "b1-8", "Kdo"], ["Gal", "b1-4", "Glc", "a1-3", "LDManHep"], ["Gal", "b1-4", "Glc", "a1-4", "GalNAc"], ["Gal", "b1-4", "Glc", "a1-4", "GlcA"], ["Gal", "b1-4", "Glc", "b1-2", "LDManHep"], ["Gal", "b1-4", "Glc", "b1-3", "GalNAc"], ["Gal", "b1-4", "Glc", "b1-4", "Glc"], ["Gal", "b1-4", "Glc", "b1-4", "PseNAcNAc"], ["Gal", "b1-4", "GlcNAc", "a1-4", "Gal"], ["Gal", "b1-4", "GlcNAc", "b1-2", "Fuc"], ["Gal", "b1-4", "GlcNAc", "b1-2", "Gal"], ["Gal", "b1-4", "GlcNAc", "b1-2", "GalNAc"], ["Gal", "b1-4", "GlcNAc", "b1-2", "Glc"], ["Gal", "b1-4", "GlcNAc", "b1-2", "Man"], ["Gal", "b1-4", "GlcNAc", "b1-2", "NeuNAc"], ["Gal", "b1-4", "GlcNAc", "b1-3", "Fuc"], ["Gal", "b1-4", "GlcNAc", "b1-3", "Gal"], ["Gal", "b1-4", "GlcNAc", "b1-3", "GalNAc"], ["Gal", "b1-4", "GlcNAc", "b1-3", "GalOS"], ["Gal", "b1-4", "GlcNAc", "b1-3", "Glc"], ["Gal", "b1-4", "GlcNAc", "b1-3", "GlcNAc"], ["Gal", "b1-4", "GlcNAc", "b1-3", "NeuNAc"], ["Gal", "b1-4", "GlcNAc", "b1-4", "Fuc"], ["Gal", "b1-4", "GlcNAc", "b1-4", "Gal"], ["Gal", "b1-4", "GlcNAc", "b1-4", "GalNAc"], ["Gal", "b1-4", "GlcNAc", "b1-4", "GalOS"], ["Gal", "b1-4", "GlcNAc", "b1-4", "Glc"], ["Gal", "b1-4", "GlcNAc", "b1-4", "Man"], ["Gal", "b1-4", "GlcNAc", "b1-4", "NeuNAc"], ["Gal", "b1-4", "GlcNAc", "b1-6", "Fuc"], ["Gal", "b1-4", "GlcNAc", "b1-6", "Gal"], ["Gal", "b1-4", "GlcNAc", "b1-6", "GalNAc"], ["Gal", "b1-4", "GlcNAc", "b1-6", "GalOS"], ["Gal", "b1-4", "GlcNAc", "b1-6", "GlcNAc"], ["Gal", "b1-4", "GlcNAc", "b1-6", "Man"], ["Gal", "b1-4", "GlcNAc", "b1-6", "NeuNAc"], ["Gal", "b1-4", "GlcNAc", "b1-6", "NeuNAcOS"], ["Gal", "b1-4", "GlcNAcOS", "b1-3", "Gal"], ["Gal", "b1-4", "GlcNAcOS", "b1-3", "GalNAc"], ["Gal", "b1-4", "GlcNAcOS", "b1-6", "Fuc"], ["Gal", "b1-4", "GlcNAcOS", "b1-6", "Gal"], ["Gal", "b1-4", "GlcNAcOS", "b1-6", "GalNAc"], ["Gal", "b1-4", "GlcNAcOS", "b1-6", "NeuNAc"], ["Gal", "b1-4", "LDManHep", "a1-5", "Kdo"], ["Gal", "b1-4", "LDManHepOP", "a1-5", "KdoOP"], ["Gal", "b1-4", "ManNAc", "b1-4", "GlcA"], ["Gal", "b1-4", "NeuNAc", "a2-6", "GlcNAc"], ["Gal", "b1-4", "P1Gro-GalNAc", "b1-4", "Glc"], ["Gal", "b1-4", "Rha", "a1-3", "ManOAc"], ["Gal", "b1-6", "Gal", "b1-3", "Gal"], ["Gal", "b1-6", "Gal", "b1-3", "GlcNAc"], ["Gal", "b1-6", "Gal", "b1-4", "GlcNAc"], ["Gal", "b1-6", "Gal", "b1-6", "Gal"], ["Gal", "b1-6", "Galf", "b1-3", "GalNAc"], ["Gal", "b1-6", "Glc", "a1-2", "Glc"], ["Gal", "b1-6", "Glc", "a1-6", "GlcNAc"], ["Gal", "b1-6", "Glc", "b1-3", "Gal"], ["Gal", "b1-6", "Glc", "b1-3", "GalNAc"], ["Gal", "b1-6", "GlcNAc", "b1-6", "Gal"], ["Gal", "b1-7", "LDManHep", "a1-3", "Glc"], ["Gal", "b1-7", "LDManHep", "a1-5", "KdoOP"], ["Gal", "b1-8", "Kdo", "a1-4", "Kdo"], ["GalA", "a1-2", "Gal", "a1-3", "Galf"], ["GalA", "a1-2", "Rha", "a1-2", "Rha"], ["GalA", "a1-2", "RhaOAc", "a1-4", "Glc"], ["GalA", "a1-3", "FucNAc", "a1-3", "QuiNAc"], ["GalA", "a1-3", "GalNAc", "b1-3", "Gal"], ["GalA", "a1-3", "Glc", "b1-4", "Kdo"], ["GalA", "a1-3", "Glc", "b1-6", "Glc"], ["GalA", "a1-3", "GlcN", "a1-4", "GalA"], ["GalA", "a1-3", "GlcNAc", "a1-2", "Man"], ["GalA", "a1-3", "GlcNAc", "a1-3", "QuiNAspAc"], ["GalA", "a1-3", "GlcNAc", "a1-3", "Rha"], ["GalA", "a1-3", "GlcNAc", "b1-2", "Gal"], ["GalA", "a1-3", "GlcNAc", "b1-3", "Rha"], ["GalA", "a1-3", "GlcNAc", "b1-4", "GalAGroN"], ["GalA", "a1-3", "LDManHep", "a1-5", "KdoOP"], ["GalA", "a1-3", "Man", "a1-5", "GalA"], ["GalA", "a1-3", "QuiNAc", "b1-3", "Gal"], ["GalA", "a1-3", "RhaOAc", "a1-3", "ManOAc"], ["GalA", "a1-4", "Gal", "a1-3", "Galf"], ["GalA", "a1-4", "GalA", "a1-4", "Xyl"], ["GalA", "a1-4", "GalNAc", "a1-4", "GalNAc"], ["GalA", "a1-4", "Kdo", "a1-5", "GalA"], ["GalA", "a1-4", "Man", "a1-5", "Kdo"], ["GalA", "a1-4", "Xyl", "a1-3", "GalA"], ["GalA", "a1-7", "LDManHep", "a1-7", "Glc"], ["GalA", "b1-3", "GalNAc", "b1-2", "RhaOAc"], ["GalA", "b1-4", "Man", "b1-4", "Glc"], ["GalA", "b1-7", "LDManHep", "a1-7", "LDManHep"], ["GalAAla", "a1-3", "GlcNAc", "b1-2", "Gal"], ["GalAAlaLys", "a1-3", "GalNAc", "b1-4", "GlcA"], ["GalAAlaLys", "a1-4", "GalNAc", "a1-3", "GlcNAc"], ["GalAAlaLys", "a1-4", "GalNAc", "b1-4", "GlcA"], ["GalAGroN", "a1-4", "Gal", "a1-3", "GalA"], ["GalAGroN", "a1-4", "NeuNAc", "a2-3", "GalAGroN"], ["GalAGroN", "a1-4", "NeuNAc", "a2-3", "GalGroN"], ["GalAGroN", "b1-3", "QuiNAc", "b1-4", "GalAGroN"], ["GalAN", "a1-6", "GlcAN", "b1-3", "Glc"], ["GalASer", "b1-3", "GlcNAc", "b1-2", "QuiNAc"], ["GalGroN", "b1-3", "GlcNAc", "b1-3", "GalAGroN"], ["GalN", "a1-3", "GalN", "b1-6", "Glc"], ["GalN", "a1-4", "GlcNAcA", "a1-4", "GlcN"], ["GalN", "b1-6", "Glc", "a1-5", "Kdo"], ["GalNAc", "a1-2", "Ribf", "b1-4", "GalNAc"], ["GalNAc", "a1-3", "Fuc", "a1-2", "Gal"], ["GalNAc", "a1-3", "Fuc", "a1-2", "Man"], ["GalNAc", "a1-3", "FucNAc", "a1-3", "GlcNAc"], ["GalNAc", "a1-3", "FucNAc", "a1-3", "QuiNHse"], ["GalNAc", "a1-3", "Gal", "b1-3", "Gal"], ["GalNAc", "a1-3", "Gal", "b1-3", "GalNAc"], ["GalNAc", "a1-3", "Gal", "b1-3", "GlcNAc"], ["GalNAc", "a1-3", "Gal", "b1-4", "Fuc"], ["GalNAc", "a1-3", "Gal", "b1-4", "GlcNAc"], ["GalNAc", "a1-3", "GalNAc", "a1-2", "Glc"], ["GalNAc", "a1-3", "GalNAc", "a1-3", "QuiNAc"], ["GalNAc", "a1-3", "GalNAc", "b1-2", "Gal"], ["GalNAc", "a1-3", "GalNAc", "b1-2", "Glc"], ["GalNAc", "a1-3", "GalNAc", "b1-3", "Gal"], ["GalNAc", "a1-3", "GalNAc", "b1-3", "GalA"], ["GalNAc", "a1-3", "GalNAc", "b1-3", "GalNAc"], ["GalNAc", "a1-3", "GalNAc", "b1-3", "GlcNAc"], ["GalNAc", "a1-3", "GalNAc", "b1-3", "Rha"], ["GalNAc", "a1-3", "GalNAc", "b1-4", "Gal"], ["GalNAc", "a1-3", "GalNAc", "b1-4", "Rha"], ["GalNAc", "a1-3", "GalNAc", "b1-6", "GlcN"], ["GalNAc", "a1-3", "GalNAcOAc", "b1-2", "Gal"], ["GalNAc", "a1-3", "Glc", "a1-4", "FucNAc"], ["GalNAc", "a1-3", "Glc", "a1-6", "GalNAc"], ["GalNAc", "a1-3", "GlcA", "b1-4", "Fuc"], ["GalNAc", "a1-3", "GlcNAc", "a1-2", "Fuc"], ["GalNAc", "a1-3", "GlcNAc", "a1-3", "GalAAlaLys"], ["GalNAc", "a1-3", "GlcNAc", "a1-6", "GlcNAc"], ["GalNAc", "a1-3", "GlcNAc", "b1-2", "Glc"], ["GalNAc", "a1-3", "GlcNAc", "b1-2", "Man"], ["GalNAc", "a1-3", "GlcNAc", "b1-4", "Fuc"], ["GalNAc", "a1-3", "GlcNAc", "b1-6", "Glc"], ["GalNAc", "a1-3", "LDManHepOCm", "a1-3", "LDManHep"], ["GalNAc", "a1-3", "LDManHepOCm", "a1-3", "LDManHepOP"], ["GalNAc", "a1-3", "NeuNAc", "a2-6", "Gal"], ["GalNAc", "a1-3", "NeuNAc", "a2-6", "GalNAc"], ["GalNAc", "a1-3", "QuiNAc", "a1-2", "Rha"], ["GalNAc", "a1-3", "QuiNAc", "a1-3", "QuiNThrAc"], ["GalNAc", "a1-4", "Gal", "a1-6", "Gal"], ["GalNAc", "a1-4", "Gal", "b1-3", "GalNAc"], ["GalNAc", "a1-4", "GalA", "a1-3", "GlcNAc"], ["GalNAc", "a1-4", "GalNAc", "a1-3", "GalNAc"], ["GalNAc", "a1-4", "GalNAc", "b1-4", "GalNAc"], ["GalNAc", "a1-4", "Glc", "b1-3", "GalNAc"], ["GalNAc", "a1-4", "GlcOAcA", "a1-3", "Man"], ["GalNAc", "a1-4", "ManNAcA", "b1-6", "GalNAc"], ["GalNAc", "a1-6", "Gal", "b1-3", "Glc"], ["GalNAc", "a1-6", "Glc", "a1-4", "GlcA"], ["GalNAc", "a1-6", "ManOAc", "a1-3", "Fuc"], ["GalNAc", "b1-2", "Gal", "b1-3", "GalNAc"], ["GalNAc", "b1-2", "Rha", "a1-2", "Rha"], ["GalNAc", "b1-3", "Gal", "a1-3", "GalNAc"], ["GalNAc", "b1-3", "Gal", "a1-3", "GlcNAc"], ["GalNAc", "b1-3", "Gal", "a1-4", "Gal"], ["GalNAc", "b1-3", "Gal", "a1-4", "Rha"], ["GalNAc", "b1-3", "Gal", "a1-6", "Gal"], ["GalNAc", "b1-3", "Gal", "b1-4", "GlcNAc"], ["GalNAc", "b1-3", "GalNAc", "b1-3", "Gal"], ["GalNAc", "b1-3", "Rha", "a1-2", "LDManHep"], ["GalNAc", "b1-3", "Rha", "a1-3", "Fuc"], ["GalNAc", "b1-3", "Rha", "a1-3", "QuiNAc"], ["GalNAc", "b1-4", "DDManHep", "b1-3", "GlcNAc"], ["GalNAc", "b1-4", "Fuc", "a1-3", "GlcNAc"], ["GalNAc", "b1-4", "Gal", "a1-3", "GalNAc"], ["GalNAc", "b1-4", "Gal", "b1-4", "Glc"], ["GalNAc", "b1-4", "GalNAcOAcA", "a1-3", "QuiNAc"], ["GalNAc", "b1-4", "GalOS", "b1-4", "Glc"], ["GalNAc", "b1-4", "Glc", "b1-3", "Gal"], ["GalNAc", "b1-4", "GlcA", "b1-3", "GalNAc"], ["GalNAc", "b1-4", "GlcA", "b1-3", "GlcNAc"], ["GalNAc", "b1-4", "GlcNAc", "a1-4", "Gal"], ["GalNAc", "b1-4", "GlcNAc", "a1-4", "GalNAc"], ["GalNAc", "b1-4", "GlcNAc", "b1-2", "GalNAc"], ["GalNAc", "b1-4", "GlcNAc", "b1-2", "GlcNAc"], ["GalNAc", "b1-4", "GlcNAc", "b1-2", "Man"], ["GalNAc", "b1-4", "GlcNAc", "b1-3", "Gal"], ["GalNAc", "b1-4", "GlcNAc", "b1-6", "Man"], ["GalNAc", "b1-4", "NeuAc", "a2-3", "Gal"], ["GalNAc", "b1-4", "NeuNAc", "a2-3", "Gal"], ["GalNAc", "b1-4", "NeuNAc", "a2-8", "NeuNAc"], ["GalNAc", "b1-4", "NeuNGc", "a2-3", "Gal"], ["GalNAc", "b1-4", "RhaOAc", "a1-3", "GlcNAc"], ["GalNAcA", "a1-2", "Rha", "a1-3", "Rha"], ["GalNAcA", "a1-3", "FucNAc", "a1-3", "GlcNAc"], ["GalNAcA", "a1-3", "Glc", "a1-4", "GalNAcA"], ["GalNAcA", "a1-3", "GlcNAc", "a1-4", "Glc"], ["GalNAcA", "a1-3", "QuiNAc", "a1-4", "GalNAcA"], ["GalNAcA", "a1-3", "QuiNAc", "b1-2", "GlcAOLac"], ["GalNAcA", "a1-3", "QuiNAc", "b1-2", "QuiNFo"], ["GalNAcA", "a1-3", "QuiNAc", "b1-4", "GalNAcA"], ["GalNAcA", "a1-3", "QuiNAc", "b1-4", "GalNAcAAla"], ["GalNAcA", "a1-3", "QuiNAc", "b1-4", "GlcNAcOAc"], ["GalNAcA", "a1-3", "QuiNAc", "b1-4", "QuiNAlaAc"], ["GalNAcA", "a1-3", "QuiNAc", "b1-4", "Rha"], ["GalNAcA", "a1-3", "QuiNAcNBut", "a1-2", "QuiNBut"], ["GalNAcA", "a1-4", "GalNAc", "a1-3", "QuiNAc"], ["GalNAcA", "a1-4", "GalNAcA", "a1-3", "QuiNAc"], ["GalNAcA", "a1-4", "GalNFoA", "a1-3", "QuiNAc"], ["GalNAcA", "a1-4", "GalOAc", "a1-2", "QuiNAlaAc"], ["GalNAcA", "b1-4", "GalNAcA", "a1-4", "GalNAcA"], ["GalNAcAAla", "a1-4", "GalNAcA", "a1-3", "QuiNAc"], ["GalNAcAN", "a1-2", "Rha", "a1-2", "Rha"], ["GalNAcASer", "a1-4", "ManNAcA", "b1-4", "GulNAcA"], ["GalNAcOAc", "b1-3", "Gal", "a1-3", "GalNAc"], ["GalNAcOAcA", "a1-3", "QuiNAc", "a1-3", "GlcNAc"], ["GalNAcOAcA", "a1-3", "QuiNAc", "b1-4", "PseNAcNFo"], ["GalNAcOS", "b1-4", "GlcNAc", "b1-2", "Man"], ["GalNAla", "a1-3", "LDManHepOCm", "a1-3", "LDManHepOP"], ["GalNAmA", "a1-3", "QuiNAc", "b1-3", "Fuc"], ["GalNFoA", "a1-3", "QuiNAc", "a1-3", "QuiNAc"], ["GalOAc", "a1-2", "Man", "a1-4", "Rha"], ["GalOAc", "a1-3", "FucNAm", "a1-3", "GlcNAc"], ["GalOAc", "a1-3", "Gal", "a1-3", "Rha"], ["GalOAc", "b1-3", "GlcNAc", "b1-4", "GlcA"], ["GalOAc", "b1-4", "GlcNAc", "b1-4", "GlcA"], ["GalOAcA", "a1-2", "Rha", "a1-4", "Gal"], ["GalOAcA", "b1-3", "Col", "a1-4", "GlcNAc"], ["GalOAcNAmA", "a1-3", "Sug", "a1-4", "GlcNAc"], ["GalOPA", "a1-7", "Fruf", "b2-4", "Glc"], ["GalOS", "b1-3", "Fuc", "a1-4", "GlcNAc"], ["GalOS", "b1-3", "GalNAc", "b1-4", "GalOS"], ["GalOS", "b1-3", "GlcNAc", "b1-3", "Gal"], ["GalOS", "b1-3", "GlcNAc", "b1-3", "GalNAc"], ["GalOS", "b1-3", "NeuNAc", "a2-6", "GalNAc"], ["GalOS", "b1-4", "Fuc", "a1-3", "GlcNAc"], ["GalOS", "b1-4", "Fuc", "a1-3", "GlcNAcOS"], ["GalOS", "b1-4", "GlcNAc", "b1-2", "GalOS"], ["GalOS", "b1-4", "GlcNAc", "b1-2", "Man"], ["GalOS", "b1-4", "GlcNAc", "b1-2", "NeuNAc"], ["GalOS", "b1-4", "GlcNAc", "b1-3", "Gal"], ["GalOS", "b1-4", "GlcNAc", "b1-3", "GalNAc"], ["GalOS", "b1-4", "GlcNAc", "b1-3", "NeuNAc"], ["GalOS", "b1-4", "GlcNAc", "b1-4", "Man"], ["GalOS", "b1-4", "GlcNAc", "b1-4", "NeuNAc"], ["GalOS", "b1-4", "GlcNAc", "b1-6", "Fuc"], ["GalOS", "b1-4", "GlcNAc", "b1-6", "Gal"], ["GalOS", "b1-4", "GlcNAc", "b1-6", "GalNAc"], ["GalOS", "b1-4", "GlcNAc", "b1-6", "NeuNAc"], ["GalOS", "b1-4", "GlcNAcOS", "b1-3", "GalOS"], ["Galf", "a1-2", "Rha", "a1-2", "Rha"], ["Galf", "a1-2", "Rha", "a1-3", "Man"], ["Galf", "a1-2", "Rha", "a1-6", "Glc"], ["Galf", "a1-3", "RhaOAc", "a1-4", "GlcNAc"], ["Galf", "a1-4", "Gal", "a1-3", "ManNAc"], ["Galf", "a1-4", "GalNAc", "b1-4", "RhaOAc"], ["Galf", "b1-3", "Fuc", "a1-3", "Galf"], ["Galf", "b1-3", "Gal", "a1-2", "Fuc"], ["Galf", "b1-3", "GalNAc", "b1-3", "Gal"], ["Galf", "b1-3", "GlcNAc", "b1-5", "Galf"], ["Galf", "b1-3", "Rha", "a1-2", "RhaOAc"], ["Galf", "b1-4", "Rha", "a1-3", "DDManHep"], ["Galf", "b1-6", "Gal", "a1-6", "Glc"], ["Galf", "b1-6", "Galf", "b1-5", "Galf"], ["Galf", "b1-6", "Glc", "a1-3", "RhaOAc"], ["Galf", "b1-6", "Glc", "a1-6", "Glc"], ["GalfOAc", "b1-3", "GlcNAc", "b1-2", "Gal"], ["GalfOAc", "b1-3", "Man", "b1-3", "GalfOAc"], ["Glc", "a1-2", "Gal", "a1-2", "Gal"], ["Glc", "a1-2", "Gal", "a1-6", "Glc"], ["Glc", "a1-2", "Gal", "b1-4", "Glc"], ["Glc", "a1-2", "Gal", "b1-4", "Rha"], ["Glc", "a1-2", "GalNAc", "a1-3", "Glc"], ["Glc", "a1-2", "Galf", "b1-6", "Gal"], ["Glc", "a1-2", "Galf", "b1-6", "Glc"], ["Glc", "a1-2", "Glc", "a1-2", "GlcNAc"], ["Glc", "a1-2", "Glc", "a1-4", "GalNAc"], ["Glc", "a1-2", "Glc", "a1-4", "Glc"], ["Glc", "a1-2", "Glc", "a1-4", "GlcNAc"], ["Glc", "a1-2", "Glc", "a1-6", "GalNAc"], ["Glc", "a1-2", "Glc", "b1-3", "ManNAc"], ["Glc", "a1-2", "GlcA", "b1-3", "GalNAc"], ["Glc", "a1-2", "GlcNAc", "a1-3", "Gal"], ["Glc", "a1-2", "LDManHep", "a1-6", "LDManHep"], ["Glc", "a1-2", "Man", "a1-2", "Man"], ["Glc", "a1-2", "Man", "a1-3", "GlcNAc"], ["Glc", "a1-2", "Rha", "a1-3", "Glc"], ["Glc", "a1-2", "Rha", "a1-3", "GlcNAc"], ["Glc", "a1-2", "Rha", "a1-6", "GlcNAc"], ["Glc", "a1-2", "Rha", "b1-4", "Rha"], ["Glc", "a1-3", "Fuc", "a1-4", "Fuc"], ["Glc", "a1-3", "FucNAm", "a1-3", "QuiNAcNBut"], ["Glc", "a1-3", "GalA", "b1-7", "LDManHep"], ["Glc", "a1-3", "GalNAc", "b1-3", "Rha"], ["Glc", "a1-3", "GalNAla", "a1-3", "LDManHepOCm"], ["Glc", "a1-3", "Glc", "a1-2", "GlcA"], ["Glc", "a1-3", "Glc", "a1-3", "GlcN"], ["Glc", "a1-3", "Glc", "a1-3", "LDManHep"], ["Glc", "a1-3", "Glc", "a1-4", "FucNAc"], ["Glc", "a1-3", "Glc", "b1-3", "GlcN"], ["Glc", "a1-3", "GlcN", "a1-7", "LDManHep"], ["Glc", "a1-3", "GlcNAc", "a1-3", "QuiNAc"], ["Glc", "a1-3", "GlcNAc", "a1-4", "Glc"], ["Glc", "a1-3", "GlcNAc", "a1-7", "LDManHep"], ["Glc", "a1-3", "GlcNAc", "b1-4", "GlcA"], ["Glc", "a1-3", "LDManHep", "a1-3", "Glc"], ["Glc", "a1-3", "LDManHep", "a1-5", "KdoOP"], ["Glc", "a1-3", "LDManHep", "a1-7", "LDManHepOP"], ["Glc", "a1-3", "Man", "a1-2", "Man"], ["Glc", "a1-3", "Man", "a1-3", "GlcNAc"], ["Glc", "a1-3", "Man", "b1-3", "GlcNAc"], ["Glc", "a1-3", "QuiNAc", "a1-3", "GlcNAc"], ["Glc", "a1-3", "QuiNAc", "a1-4", "Glc"], ["Glc", "a1-3", "Rha", "a1-2", "Glc"], ["Glc", "a1-3", "Rha", "a1-2", "Rha"], ["Glc", "a1-3", "Rha", "a1-3", "Fuc"], ["Glc", "a1-3", "Rha", "a1-3", "ManNAcOAc"], ["Glc", "a1-3", "Rha", "a1-3", "Rha"], ["Glc", "a1-3", "Rha", "a1-4", "Glc"], ["Glc", "a1-3", "RhaOAc", "a1-3", "Glc"], ["Glc", "a1-3", "RhaOAc", "a1-3", "ManNAc"], ["Glc", "a1-3", "Xyl", "b1-4", "Rha"], ["Glc", "a1-4", "FucNAc", "a1-3", "GlcNAc"], ["Glc", "a1-4", "Gal", "a1-2", "Man"], ["Glc", "a1-4", "Gal", "a1-3", "GalNAc"], ["Glc", "a1-4", "Gal", "a1-3", "GlcNAc"], ["Glc", "a1-4", "Gal", "a1-6", "Man"], ["Glc", "a1-4", "Gal", "b1-4", "Gal"], ["Glc", "a1-4", "Gal", "b1-4", "Glc"], ["Glc", "a1-4", "Gal", "b1-4", "LDManHepOP"], ["Glc", "a1-4", "Gal", "b1-6", "Glc"], ["Glc", "a1-4", "Gal", "b1-6", "Man"], ["Glc", "a1-4", "GalAAla", "a1-3", "GlcNAc"], ["Glc", "a1-4", "GalNAc", "a1-3", "GalNAc"], ["Glc", "a1-4", "GalNAc", "a1-3", "GlcNAc"], ["Glc", "a1-4", "GalNAc", "a1-4", "QuiNAc"], ["Glc", "a1-4", "GalNAc", "b1-3", "Gal"], ["Glc", "a1-4", "GalNAc", "b1-4", "GlcNAc"], ["Glc", "a1-4", "GalNAcA", "a1-3", "Glc"], ["Glc", "a1-4", "GalNAcA", "a1-3", "GlcNAc"], ["Glc", "a1-4", "Glc", "a1-3", "GalA"], ["Glc", "a1-4", "Glc", "a1-3", "Rha"], ["Glc", "a1-4", "Glc", "a1-4", "Glc"], ["Glc", "a1-4", "Glc", "a1-4", "GlcA"], ["Glc", "a1-4", "Glc", "a1-4", "GlcOAcA"], ["Glc", "a1-4", "Glc", "b1-3", "GalNAc"], ["Glc", "a1-4", "Glc", "b1-6", "Glc"], ["Glc", "a1-4", "GlcA", "b1-3", "GalNAc"], ["Glc", "a1-4", "GlcA", "b1-4", "Glc"], ["Glc", "a1-4", "GlcNAc", "a1-4", "Glc"], ["Glc", "a1-4", "GlcNAc", "b1-2", "P1Gro-Glc"], ["Glc", "a1-4", "GlcNAc", "b1-2", "Rha"], ["Glc", "a1-4", "GlcNAc", "b1-2", "RhaOAc"], ["Glc", "a1-4", "GlcNAc", "b1-3", "Gal"], ["Glc", "a1-4", "GlcNAc", "b1-3", "RhaOAc"], ["Glc", "a1-4", "GlcOAcA", "b1-3", "GlcNAc"], ["Glc", "a1-4", "Man", "a1-2", "Man"], ["Glc", "a1-4", "Man", "b1-3", "FucNAc"], ["Glc", "a1-4", "P1Gro-Gal", "b1-3", "GlcNAcOAc"], ["Glc", "a1-4", "Qui", "a1-3", "GlcNAc"], ["Glc", "a1-4", "Rha", "a1-3", "GlcNAc"], ["Glc", "a1-4", "Rha", "a1-3", "GlcNAcOAc"], ["Glc", "a1-4", "RhaOPEtn", "a1-3", "GalNAc"], ["Glc", "a1-5", "Dha", "a2-3", "GalA"], ["Glc", "a1-5", "Kdo", "a1-4", "Kdo"], ["Glc", "a1-5", "Kdo", "a1-8", "Glc"], ["Glc", "a1-5", "Ribf", "b1-4", "GalA"], ["Glc", "a1-6", "Gal", "a1-2", "Man"], ["Glc", "a1-6", "Gal", "a1-3", "FucNAc"], ["Glc", "a1-6", "Gal", "a1-3", "LDManHep"], ["Glc", "a1-6", "Gal", "a1-6", "Man"], ["Glc", "a1-6", "GalNAc", "a1-3", "FucNAc"], ["Glc", "a1-6", "GalNAc", "a1-3", "GalNAc"], ["Glc", "a1-6", "GalNAc", "b1-3", "Gal"], ["Glc", "a1-6", "GalNAc", "b1-4", "NeuNAc"], ["Glc", "a1-6", "GalNAc", "b1-4", "P1Gro-GalNAc"], ["Glc", "a1-6", "GalNAc", "b1-6", "Glc"], ["Glc", "a1-6", "Glc", "a1-4", "Gal"], ["Glc", "a1-6", "Glc", "a1-4", "GlcNAc"], ["Glc", "a1-6", "Glc", "a1-6", "Glc"], ["Glc", "a1-6", "Glc", "b1-3", "Galf"], ["Glc", "a1-6", "Glc", "b1-4", "Glc"], ["Glc", "a1-6", "GlcNAc", "a1-4", "GalA"], ["Glc", "a1-6", "GlcNAc", "a1-4", "GalNAc"], ["Glc", "a1-6", "GlcNAc", "b1-2", "Rha"], ["Glc", "a1-6", "GlcNAc", "b1-3", "Gal"], ["Glc", "a1-6", "GlcNAc", "b1-3", "P1Gro-Glc"], ["Glc", "a1-6", "GlcNAc", "b1-4", "P1Gro-Glc"], ["Glc", "a1-6", "GlcNBut", "a1-4", "GalNAc"], ["Glc", "a1-6", "GlcNBut", "a1-4", "Glc"], ["Glc", "a1-6", "GlcNButOAc", "a1-4", "Glc"], ["Glc", "a1-6", "LDManHep", "a1-5", "Kdo"], ["Glc", "a1-7", "DDManHep", "a1-2", "LDManHep"], ["Glc", "b1-2", "FucNAc", "b1-6", "Glc"], ["Glc", "b1-2", "FucNBut", "b1-6", "GlcNAc"], ["Glc", "b1-2", "FucOAcNBut", "b1-6", "GlcNAc"], ["Glc", "b1-2", "Gal", "b1-3", "GalNAc"], ["Glc", "b1-2", "LDManHep", "a1-2", "GalNAc"], ["Glc", "b1-2", "LDManHep", "a1-3", "Gal"], ["Glc", "b1-2", "Rha", "a1-3", "Rha"], ["Glc", "b1-3", "FucNAcOAc", "a1-4", "Glc"], ["Glc", "b1-3", "Gal", "a1-4", "GalNAc"], ["Glc", "b1-3", "Gal", "a1-4", "Glc"], ["Glc", "b1-3", "Gal", "b1-3", "Glc"], ["Glc", "b1-3", "GalN", "a1-4", "GlcNAcA"], ["Glc", "b1-3", "GalNAc", "a1-2", "PerNAc"], ["Glc", "b1-3", "GalNAc", "a1-2", "QuiNAlaAc"], ["Glc", "b1-3", "GalNAc", "a1-3", "GalNAc"], ["Glc", "b1-3", "GalNAc", "a1-3", "GalNAcOAc"], ["Glc", "b1-3", "GalNAc", "a1-3", "Glc"], ["Glc", "b1-3", "GalNAc", "a1-3", "GlcNAc"], ["Glc", "b1-3", "GalNAc", "a1-3", "LDManHepOCm"], ["Glc", "b1-3", "GalNAc", "a1-4", "GalNAc"], ["Glc", "b1-3", "GalNAc", "a1-6", "Gal"], ["Glc", "b1-3", "GalNAc", "b1-3", "Gal"], ["Glc", "b1-3", "GalNAc", "b1-3", "Glc"], ["Glc", "b1-3", "GalNAc", "b1-4", "GlcAAlaLys"], ["Glc", "b1-3", "GalNAc", "b1-4", "Rha"], ["Glc", "b1-3", "GalNAc", "b1-6", "Gal"], ["Glc", "b1-3", "GalNAcASer", "a1-4", "ManNAcA"], ["Glc", "b1-3", "GalNAcOAc", "b1-2", "QuiNFo"], ["Glc", "b1-3", "Galf", "b1-3", "Glc"], ["Glc", "b1-3", "Glc", "a1-3", "Glc"], ["Glc", "b1-3", "Glc", "a1-4", "Gal"], ["Glc", "b1-3", "Glc", "a1-7", "DDManHep"], ["Glc", "b1-3", "Glc", "b1-4", "GalNAc"], ["Glc", "b1-3", "Glc", "b1-4", "Glc"], ["Glc", "b1-3", "GlcN", "b1-7", "LDManHep"], ["Glc", "b1-3", "GlcNAc", "b1-2", "Man"], ["Glc", "b1-3", "GlcNAcOAc", "a1-3", "GlcA"], ["Glc", "b1-3", "ManOAc", "b1-4", "Glc"], ["Glc", "b1-3", "Rha", "a1-3", "Rha"], ["Glc", "b1-3", "Rha", "a1-4", "Glc"], ["Glc", "b1-4", "AraN", "b1-7", "LDManHep"], ["Glc", "b1-4", "Fuc", "a1-2", "Gal"], ["Glc", "b1-4", "Gal", "a1-5", "Kdo"], ["Glc", "b1-4", "Gal", "a1-6", "Man"], ["Glc", "b1-4", "Gal", "b1-2", "Xyl"], ["Glc", "b1-4", "GalA", "a1-3", "LDManHep"], ["Glc", "b1-4", "GalA", "a1-3", "Man"], ["Glc", "b1-4", "GalA", "b1-4", "Man"], ["Glc", "b1-4", "GalNAc", "a1-2", "RhaNAc"], ["Glc", "b1-4", "GalNAc", "a1-4", "QuiNAc"], ["Glc", "b1-4", "GalNAc", "b1-4", "GalNAc"], ["Glc", "b1-4", "Glc", "a1-3", "GalNAla"], ["Glc", "b1-4", "Glc", "a1-6", "LDManHep"], ["Glc", "b1-4", "Glc", "b1-3", "GalN"], ["Glc", "b1-4", "Glc", "b1-3", "Glc"], ["Glc", "b1-4", "Glc", "b1-4", "Glc"], ["Glc", "b1-4", "GlcNAc", "a1-6", "GlcNAc"], ["Glc", "b1-4", "GlcNAc", "a1-6", "GlcNAcOLac"], ["Glc", "b1-4", "GlcOAc", "a1-4", "GalNAc"], ["Glc", "b1-4", "Kdo", "a1-4", "GalA"], ["Glc", "b1-4", "LDManHep", "a1-5", "Kdo"], ["Glc", "b1-4", "Man", "b1-4", "Glc"], ["Glc", "b1-4", "Man", "b1-4", "Man"], ["Glc", "b1-4", "Rha", "a1-3", "Man"], ["Glc", "b1-4", "Xyl", "a1-6", "Glc"], ["Glc", "b1-6", "Gal", "a1-6", "GalNAc"], ["Glc", "b1-6", "Gal", "b1-6", "Gal"], ["Glc", "b1-6", "GalNAc", "a1-3", "Man"], ["Glc", "b1-6", "GalNAc", "b1-3", "Gal"], ["Glc", "b1-6", "Glc", "a1-5", "Dha"], ["Glc", "b1-6", "Glc", "a1-5", "Kdo"], ["Glc", "b1-6", "Glc", "b1-3", "GalNAc"], ["Glc", "b1-6", "GlcNAc", "a1-2", "Galf"], ["Glc", "b1-6", "GlcNAc", "b1-2", "Gal"], ["Glc", "b1-6", "GlcNAc", "b1-3", "Gal"], ["Glc", "b1-6", "Kdo", "a1-4", "Glc"], ["GlcA", "a1-2", "Xyl", "b1-4", "GlcA"], ["GlcA", "a1-2", "Xyl", "b1-4", "Xyl"], ["GlcA", "a1-3", "Fuc", "a1-4", "GlcNAc"], ["GlcA", "a1-4", "GalNAc", "b1-4", "GalNAcOAcA"], ["GlcA", "a1-4", "Glc", "b1-3", "GalNAcOAc"], ["GlcA", "a1-4", "GlcNAc", "a1-3", "RhaOAc"], ["GlcA", "a1-4", "GlcNAcOAc", "a1-3", "RhaOAc"], ["GlcA", "a1-6", "GlcNAc", "a1-4", "GulNA"], ["GlcA", "b1-2", "Rha", "a1-2", "Rha"], ["GlcA", "b1-2", "RhaOAc", "a1-3", "Man"], ["GlcA", "b1-3", "Col", "a1-2", "Gal"], ["GlcA", "b1-3", "FucNAc", "a1-2", "QuiNFo"], ["GlcA", "b1-3", "Gal", "b1-3", "GlcNAc"], ["GlcA", "b1-3", "GalASer", "b1-3", "GlcNAc"], ["GlcA", "b1-3", "GalNAc", "a1-2", "QuiNAlaAc"], ["GlcA", "b1-3", "GalNAc", "a1-4", "QuiNAc"], ["GlcA", "b1-3", "GalNAc", "b1-2", "Col"], ["GlcA", "b1-3", "GalNAc", "b1-2", "GalAAlaLys"], ["GlcA", "b1-3", "GalNAc", "b1-2", "GalOAc"], ["GlcA", "b1-3", "GalNAc", "b1-3", "Gal"], ["GlcA", "b1-3", "GalNAc", "b1-4", "GalNAc"], ["GlcA", "b1-3", "GalNAc", "b1-4", "QuiNFo"], ["GlcA", "b1-3", "GalNAc", "b1-6", "ManNAc"], ["GlcA", "b1-3", "GlcNAc", "a1-2", "Gal"], ["GlcA", "b1-3", "GlcNAc", "a1-2", "Man"], ["GlcA", "b1-3", "GlcNAc", "a1-8", "LegOAc"], ["GlcA", "b1-3", "GlcNAc", "b1-4", "QuiNBut"], ["GlcA", "b1-3", "GlcNAc", "b1-6", "GalNAc"], ["GlcA", "b1-3", "QuiNAcNBut", "a1-4", "GlcA"], ["GlcA", "b1-3", "QuiNAcNBut", "b1-2", "IdoA"], ["GlcA", "b1-4", "Fuc", "a1-3", "Glc"], ["GlcA", "b1-4", "FucOAc", "a1-3", "Ribf"], ["GlcA", "b1-4", "GalA", "a1-3", "Glc"], ["GlcA", "b1-4", "GalNAc", "a1-3", "Fuc"], ["GlcA", "b1-4", "GalNAcA", "a1-3", "QuiNAc"], ["GlcA", "b1-4", "GalNAcOAc", "b1-3", "Gal"], ["GlcA", "b1-4", "Glc", "a1-2", "Glc"], ["GlcA", "b1-4", "Glc", "a1-3", "Fuc"], ["GlcA", "b1-4", "GlcA", "b1-3", "FucNAc"], ["GlcA", "b1-4", "GlcA", "b1-3", "GlcNAc"], ["GlcA", "b1-4", "GlcA", "b1-3", "QuiNAcNBut"], ["GlcAAlaLys", "b1-6", "Gal", "b1-6", "Glc"], ["GlcAN", "b1-3", "Glc", "b1-4", "Gal"], ["GlcAN", "b1-6", "GlcNAc", "b1-4", "GlcA"], ["GlcAOLac", "b1-4", "GlcA", "b1-4", "GalNAcA"], ["GlcASer", "b1-3", "GalNAc", "b1-4", "Glc"], ["GlcASer", "b1-4", "GlcNAc", "a1-4", "ManNAcASer"], ["GlcN", "a1-4", "GalA", "a1-3", "GlcN"], ["GlcN", "a1-4", "GalA", "a1-7", "LDManHep"], ["GlcN", "a1-4", "GlcA", "b1-4", "GalA"], ["GlcN", "a1-7", "LDManHep", "a1-7", "LDManHepOP"], ["GlcN", "b1-2", "Gal", "b1-4", "Gal"], ["GlcN", "b1-3", "Glc", "a1-6", "GlcNAc"], ["GlcN", "b1-7", "Kdo", "a2-5", "Kdo"], ["GlcN", "b1-7", "LDManHep", "a1-7", "LDManHep"], ["GlcNAc", "a1-2", "Rha", "a1-3", "GlcNAc"], ["GlcNAc", "a1-3", "Fuc", "a1-3", "FucNAc"], ["GlcNAc", "a1-3", "FucNAc", "a1-3", "Glc"], ["GlcNAc", "a1-3", "FucNAc", "a1-3", "GlcNAc"], ["GlcNAc", "a1-3", "Gal", "a1-3", "Glc"], ["GlcNAc", "a1-3", "Gal", "b1-3", "GlcNAc"], ["GlcNAc", "a1-3", "GalNAc", "b1-3", "Gal"], ["GlcNAc", "a1-3", "GalNAc", "b1-3", "GlcNAc"], ["GlcNAc", "a1-3", "Glc", "a1-2", "Gal"], ["GlcNAc", "a1-3", "Man", "a1-2", "Man"], ["GlcNAc", "a1-3", "QuiNAc", "a1-3", "GlcNAc"], ["GlcNAc", "a1-3", "Rha", "a1-3", "GlcNAc"], ["GlcNAc", "a1-3", "Rha", "a1-4", "GlcNAc"], ["GlcNAc", "a1-4", "Gal", "b1-3", "GalNAc"], ["GlcNAc", "a1-4", "Gal", "b1-3", "GlcNAc"], ["GlcNAc", "a1-4", "Gal", "b1-4", "GlcNAc"], ["GlcNAc", "a1-4", "GalA", "a1-3", "GlcNAc"], ["GlcNAc", "a1-4", "GalA", "a1-3", "QuiNAc"], ["GlcNAc", "a1-4", "GalNAc", "a1-3", "GalNAc"], ["GlcNAc", "a1-4", "GalNAc", "a1-6", "GlcNAc"], ["GlcNAc", "a1-4", "GalNAc", "b1-3", "Gal"], ["GlcNAc", "a1-4", "Glc", "b1-3", "GalNAc"], ["GlcNAc", "a1-4", "Glc", "b1-3", "Glc"], ["GlcNAc", "a1-4", "GlcA", "b1-3", "GalNAc"], ["GlcNAc", "a1-4", "GlcNAc", "a1-3", "FucNAc"], ["GlcNAc", "a1-4", "GulNA", "a1-3", "FucNAc"], ["GlcNAc", "a1-4", "ManNAcASer", "b1-4", "GlcNAc"], ["GlcNAc", "a1-4", "Rha", "a1-3", "GlcNAc"], ["GlcNAc", "a1-6", "Gal", "a1-4", "Gal"], ["GlcNAc", "a1-7", "LDManHep", "a1-7", "LDManHepOP"], ["GlcNAc", "b1-2", "Fuc", "a1-2", "Gal"], ["GlcNAc", "b1-2", "Fuc", "a1-2", "NeuNAc"], ["GlcNAc", "b1-2", "Fuc", "a1-3", "Gal"], ["GlcNAc", "b1-2", "Fuc", "a1-3", "RhaOAc"], ["GlcNAc", "b1-2", "Gal", "b1-3", "GalNAc"], ["GlcNAc", "b1-2", "Gal", "b1-4", "GlcNAc"], ["GlcNAc", "b1-2", "GalNAc", "b1-4", "GlcNAc"], ["GlcNAc", "b1-2", "GalNAc", "b1-4", "NeuNAc"], ["GlcNAc", "b1-2", "GalOS", "b1-4", "GlcNAc"], ["GlcNAc", "b1-2", "Glc", "b1-2", "Gal"], ["GlcNAc", "b1-2", "Glc", "b1-3", "GalNAc"], ["GlcNAc", "b1-2", "Glc", "b1-6", "Kdo"], ["GlcNAc", "b1-2", "GlcNAc", "b1-4", "Man"], ["GlcNAc", "b1-2", "GlcNAc", "b1-6", "Man"], ["GlcNAc", "b1-2", "Man", "a1-3", "Fuc"], ["GlcNAc", "b1-2", "Man", "a1-3", "Gal"], ["GlcNAc", "b1-2", "Man", "a1-3", "GalNAc"], ["GlcNAc", "b1-2", "Man", "a1-3", "GalNAcOS"], ["GlcNAc", "b1-2", "Man", "a1-3", "GalOS"], ["GlcNAc", "b1-2", "Man", "a1-3", "GlcNAc"], ["GlcNAc", "b1-2", "Man", "a1-3", "Man"], ["GlcNAc", "b1-2", "Man", "a1-3", "NeuNAc"], ["GlcNAc", "b1-2", "Man", "a1-3", "NeuNGc"], ["GlcNAc", "b1-2", "Man", "a1-6", "Fuc"], ["GlcNAc", "b1-2", "Man", "a1-6", "Gal"], ["GlcNAc", "b1-2", "Man", "a1-6", "GalNAc"], ["GlcNAc", "b1-2", "Man", "a1-6", "GalNAcOS"], ["GlcNAc", "b1-2", "Man", "a1-6", "GalOS"], ["GlcNAc", "b1-2", "Man", "a1-6", "GlcNAc"], ["GlcNAc", "b1-2", "Man", "a1-6", "Man"], ["GlcNAc", "b1-2", "Man", "a1-6", "NeuNAc"], ["GlcNAc", "b1-2", "Man", "a1-6", "NeuNGc"], ["GlcNAc", "b1-2", "Man", "b1-4", "Glc"], ["GlcNAc", "b1-2", "NeuNAc", "a2-3", "Gal"], ["GlcNAc", "b1-2", "NeuNAc", "a2-6", "Gal"], ["GlcNAc", "b1-2", "P1Gro-Glc", "b1-3", "Glc"], ["GlcNAc", "b1-2", "Rha", "a1-2", "Rha"], ["GlcNAc", "b1-2", "Rha", "a1-3", "Rha"], ["GlcNAc", "b1-2", "Rha", "a1-6", "Glc"], ["GlcNAc", "b1-3", "Fuc", "a1-2", "Gal"], ["GlcNAc", "b1-3", "Fuc", "a1-3", "Gal"], ["GlcNAc", "b1-3", "Fuc", "a1-3", "GlcNAc"], ["GlcNAc", "b1-3", "Gal", "a1-3", "GalNAc"], ["GlcNAc", "b1-3", "Gal", "a1-3", "GlcNAc"], ["GlcNAc", "b1-3", "Gal", "b1-2", "P1Gro-FucNAc"], ["GlcNAc", "b1-3", "Gal", "b1-3", "Fuc"], ["GlcNAc", "b1-3", "Gal", "b1-3", "Gal"], ["GlcNAc", "b1-3", "Gal", "b1-3", "GalNAc"], ["GlcNAc", "b1-3", "Gal", "b1-3", "GlcNAc"], ["GlcNAc", "b1-3", "Gal", "b1-3", "NeuNAc"], ["GlcNAc", "b1-3", "Gal", "b1-4", "Fuc"], ["GlcNAc", "b1-3", "Gal", "b1-4", "Glc"], ["GlcNAc", "b1-3", "Gal", "b1-4", "GlcNAc"], ["GlcNAc", "b1-3", "Gal", "b1-4", "GlcNAcOS"], ["GlcNAc", "b1-3", "Gal", "b1-7", "LDManHep"], ["GlcNAc", "b1-3", "GalNAc", "a1-3", "Gal"], ["GlcNAc", "b1-3", "GalNAc", "a1-3", "NeuNAc"], ["GlcNAc", "b1-3", "GalNAc", "a1-3", "QuiNAc"], ["GlcNAc", "b1-3", "GalNAc", "b1-6", "Glc"], ["GlcNAc", "b1-3", "GalOS", "b1-3", "GalNAc"], ["GlcNAc", "b1-3", "GalOS", "b1-4", "GlcNAc"], ["GlcNAc", "b1-3", "Glc", "a1-3", "LDManHep"], ["GlcNAc", "b1-3", "GlcA", "a1-4", "GlcNAc"], ["GlcNAc", "b1-3", "GlcNAc", "b1-2", "Glc"], ["GlcNAc", "b1-3", "GlcNAc", "b1-6", "Gal"], ["GlcNAc", "b1-3", "GlcNAc", "b1-6", "GalNAc"], ["GlcNAc", "b1-3", "Kdo", "a2-4", "GalNAc"], ["GlcNAc", "b1-3", "NeuNAc", "a2-3", "Gal"], ["GlcNAc", "b1-3", "NeuNAc", "a2-6", "Gal"], ["GlcNAc", "b1-3", "NeuNAc", "a2-6", "GalNAc"], ["GlcNAc", "b1-3", "Rha", "a1-2", "Rha"], ["GlcNAc", "b1-3", "Rha", "a1-3", "Rha"], ["GlcNAc", "b1-4", "Fuc", "a1-2", "Gal"], ["GlcNAc", "b1-4", "Fuc", "a1-3", "Fuc"], ["GlcNAc", "b1-4", "Fuc", "a1-3", "Glc"], ["GlcNAc", "b1-4", "Fuc", "a1-3", "GlcNAc"], ["GlcNAc", "b1-4", "Fuc", "a1-6", "Fuc"], ["GlcNAc", "b1-4", "Fuc", "a1-6", "GlcNAc"], ["GlcNAc", "b1-4", "Gal", "b1-4", "GlcNAc"], ["GlcNAc", "b1-4", "GalA", "a1-3", "QuiNAc"], ["GlcNAc", "b1-4", "GalNAc", "b1-4", "GlcNAc"], ["GlcNAc", "b1-4", "GalOAcNAmA", "a1-3", "Sug"], ["GlcNAc", "b1-4", "GalOS", "b1-4", "GlcNAc"], ["GlcNAc", "b1-4", "Glc", "b1-3", "GalNAc"], ["GlcNAc", "b1-4", "GlcA", "b1-3", "GalNAc"], ["GlcNAc", "b1-4", "GlcA", "b1-3", "GlcNAc"], ["GlcNAc", "b1-4", "GlcNAc", "a1-8", "LegOAcNBut"], ["GlcNAc", "b1-4", "GlcNAc", "b1-2", "Man"], ["GlcNAc", "b1-4", "GlcNAc", "b1-2", "P1Gro-Glc"], ["GlcNAc", "b1-4", "GlcNAc", "b1-3", "Kdo"], ["GlcNAc", "b1-4", "Man", "a1-3", "Gal"], ["GlcNAc", "b1-4", "Man", "a1-3", "GalNAc"], ["GlcNAc", "b1-4", "Man", "a1-3", "GalOS"], ["GlcNAc", "b1-4", "Man", "a1-3", "GlcNAc"], ["GlcNAc", "b1-4", "Man", "a1-3", "Man"], ["GlcNAc", "b1-4", "Man", "a1-3", "NeuNAc"], ["GlcNAc", "b1-4", "Man", "a1-6", "Man"], ["GlcNAc", "b1-4", "Man", "b1-4", "GlcNAc"], ["GlcNAc", "b1-4", "Man", "b1-4", "Man"], ["GlcNAc", "b1-4", "ManNBut", "a1-4", "RhaOMe"], ["GlcNAc", "b1-4", "NeuNAc", "a2-3", "Gal"], ["GlcNAc", "b1-4", "NeuNAc", "a2-6", "Gal"], ["GlcNAc", "b1-4", "Rha", "a1-3", "GalNAc"], ["GlcNAc", "b1-4", "Rha", "a1-3", "GlcNAc"], ["GlcNAc", "b1-6", "Col", "a1-2", "Sug"], ["GlcNAc", "b1-6", "Fuc", "a1-2", "Gal"], ["GlcNAc", "b1-6", "Fuc", "a1-2", "GalNAc"], ["GlcNAc", "b1-6", "Fuc", "a1-3", "Gal"], ["GlcNAc", "b1-6", "Fuc", "a1-4", "Gal"], ["GlcNAc", "b1-6", "Gal", "a1-3", "RhaOAc"], ["GlcNAc", "b1-6", "Gal", "a1-6", "Glc"], ["GlcNAc", "b1-6", "Gal", "b1-3", "Fuc"], ["GlcNAc", "b1-6", "Gal", "b1-3", "Gal"], ["GlcNAc", "b1-6", "Gal", "b1-3", "GalNAc"], ["GlcNAc", "b1-6", "Gal", "b1-3", "GlcNAc"], ["GlcNAc", "b1-6", "Gal", "b1-4", "Fuc"], ["GlcNAc", "b1-6", "Gal", "b1-4", "Glc"], ["GlcNAc", "b1-6", "Gal", "b1-4", "GlcNAc"], ["GlcNAc", "b1-6", "GalNAc", "b1-4", "GlcNAc"], ["GlcNAc", "b1-6", "GalOS", "b1-3", "GalNAc"], ["GlcNAc", "b1-6", "GalOS", "b1-4", "GlcNAc"], ["GlcNAc", "b1-6", "GlcNAc", "a1-4", "Gal"], ["GlcNAc", "b1-6", "GlcNAc", "b1-3", "Gal"], ["GlcNAc", "b1-6", "GlcNAc", "b1-3", "GalNAc"], ["GlcNAc", "b1-6", "GlcNAc", "b1-4", "GalNAc"], ["GlcNAc", "b1-6", "GlcNAc", "b1-6", "Gal"], ["GlcNAc", "b1-6", "GlcNAcOS", "b1-3", "GalNAc"], ["GlcNAc", "b1-6", "Man", "a1-3", "Fuc"], ["GlcNAc", "b1-6", "Man", "a1-3", "Gal"], ["GlcNAc", "b1-6", "Man", "a1-3", "GlcNAc"], ["GlcNAc", "b1-6", "Man", "a1-3", "NeuNAc"], ["GlcNAc", "b1-6", "Man", "a1-6", "Fuc"], ["GlcNAc", "b1-6", "Man", "a1-6", "Gal"], ["GlcNAc", "b1-6", "Man", "a1-6", "GalNAc"], ["GlcNAc", "b1-6", "Man", "a1-6", "GalOS"], ["GlcNAc", "b1-6", "Man", "a1-6", "GlcNAc"], ["GlcNAc", "b1-6", "Man", "a1-6", "Man"], ["GlcNAc", "b1-6", "Man", "a1-6", "NeuNAc"], ["GlcNAc", "b1-6", "NeuNAc", "a2-3", "Gal"], ["GlcNAc", "b1-6", "NeuNAc", "a2-6", "Gal"], ["GlcNAc", "b1-6", "NeuNAcOS", "a2-3", "Gal"], ["GlcNAc", "b1-7", "Glc", "a1-2", "LDManHep"], ["GlcNAcA", "a1-4", "GlcN", "b1-7", "Kdo"], ["GlcNAcA", "b1-3", "GlcNAcA", "b1-3", "QuiNAcNAm"], ["GlcNAcA", "b1-3", "QuiNAcNAm", "a1-4", "GlcNAcA"], ["GlcNAcA", "b1-4", "GalNAcA", "a1-4", "GlcNAcA"], ["GlcNAcA", "b1-4", "GlcNAc", "b1-6", "Gal"], ["GlcNAcA", "b1-4", "GlcNAcA", "b1-4", "GalNAcA"], ["GlcNAcNAla", "b1-4", "ManNAcNAmA", "b1-4", "GlcNAcNAla"], ["GlcNAcNAlaFo", "b1-4", "GlcNAcNAmA", "b1-4", "GlcNAcNAlaFo"], ["GlcNAcNAlaFo", "b1-4", "ManNAcNAmA", "b1-4", "GlcNAcNAlaFo"], ["GlcNAcNButA", "b1-4", "FucOAcNAm", "a1-3", "QuiNAc"], ["GlcNAcOAc", "a1-3", "RhaOAc", "b1-4", "GlcNAc"], ["GlcNAcOAc", "a1-4", "GalNAcA", "a1-3", "QuiNAc"], ["GlcNAcOAc", "b1-2", "Glc", "a1-4", "P1Gro-Gal"], ["GlcNAcOAc", "b1-2", "P1Gro-Gal", "b1-3", "GlcNAcOAc"], ["GlcNAcOAc", "b1-4", "FucNAm", "a1-3", "GlcNAc"], ["GlcNAcOAcA", "b1-4", "FucOAcNAm", "a1-3", "Sug"], ["GlcNAcOAcOLac", "a1-3", "QuiNAc", "a1-3", "GlcNAc"], ["GlcNAcOLac", "a1-3", "FucNAc", "a1-3", "Glc"], ["GlcNAcOLac", "a1-3", "Rha", "b1-4", "GlcNAc"], ["GlcNAcOLacAla", "a1-4", "GlcNAc", "b1-4", "GlcNAcOLacAla"], ["GlcNAcOMe", "b1-2", "Rha", "a1-3", "Rha"], ["GlcNAcOPyr", "a1-4", "Gal", "a1-4", "Gal"], ["GlcNAcOS", "b1-3", "Gal", "b1-3", "GalNAc"], ["GlcNAcOS", "b1-3", "Gal", "b1-3", "NeuNAc"], ["GlcNAcOS", "b1-3", "NeuNAc", "a2-6", "GalNAc"], ["GlcNAcOS", "b1-4", "GlcNAc", "b1-2", "Man"], ["GlcNAcOS", "b1-6", "Fuc", "a1-2", "Gal"], ["GlcNAcOS", "b1-6", "Gal", "b1-3", "GalNAc"], ["GlcNAcOS", "b1-6", "NeuNAc", "a2-3", "Gal"], ["GlcNAcOS", "b1-6", "NeuNAc", "a2-6", "Gal"], ["GlcNAm", "a1-3", "QuiNAc", "a1-3", "QuiNAlaAc"], ["GlcNAmA", "b1-4", "6dTalOAcOMe", "a1-3", "FucOAc"], ["GlcNBut", "a1-4", "GalNAc", "a1-3", "GalNAc"], ["GlcNBut", "a1-4", "Glc", "a1-6", "GalNAc"], ["GlcNButOAc", "a1-4", "Glc", "a1-6", "GalNAc"], ["GlcOAc", "a1-3", "Man", "a1-3", "Gal"], ["GlcOAc", "a1-4", "Gal", "a1-2", "Man"], ["GlcOAc", "a1-4", "Gal", "b1-4", "Rha"], ["GlcOAc", "a1-4", "GalNAc", "b1-2", "Rha"], ["GlcOAc", "a1-4", "GlcA", "b1-4", "GalNAcOAc"], ["GlcOAc", "b1-3", "GalNAc", "a1-2", "RhaNAc"], ["GlcOAcA", "a1-2", "Rha", "a1-3", "Rha"], ["GlcOAcA", "a1-3", "Man", "a1-2", "Man"], ["GlcOAcA", "b1-3", "GalNAc", "a1-3", "Man"], ["GlcOAcA", "b1-3", "GalNAc", "b1-4", "LegOAc"], ["GlcOAcA", "b1-3", "GlcNAc", "a1-2", "QuiNBut"], ["GlcOLac", "a1-3", "Rha", "a1-3", "Rha"], ["GlcOMeA", "b1-4", "6dTalOMe", "a1-3", "FucOMe"], ["GlcOSA", "b1-3", "Gal", "b1-3", "Gal"], ["GlcOSA", "b1-3", "Gal", "b1-3", "NeuNAc"], ["GlcOSA", "b1-3", "Gal", "b1-4", "GlcNAc"], ["Gul", "a1-3", "Man", "a1-3", "Fuc"], ["GulNA", "a1-3", "FucNAc", "b1-3", "QuiN"], ["GulNAcA", "a1-3", "QuiNAcNBut", "b1-4", "GalNAcASer"], ["GulNAcA", "a1-4", "GlcNAcOAc", "b1-3", "Gal"], ["GulNAcA", "a1-4", "GulNAcA", "a1-6", "Glc"], ["GulNAcA", "a1-6", "Glc", "a1-4", "GulNAcA"], ["GulNAcOAcA", "a1-3", "QuiNAcNBut", "a1-4", "ManNAcA"], ["GulNAcOAcA", "a1-3", "QuiNAcNBut", "b1-4", "ManNAcA"], ["IdoA", "a1-4", "GlcA", "b1-4", "GlcA"], ["Kdo", "a1-2", "Glc", "a1-3", "Glc"], ["Kdo", "a1-4", "GalA", "a1-4", "Kdo"], ["Kdo", "a1-4", "GalA", "a1-7", "Kdo"], ["Kdo", "a1-4", "Glc", "a1-3", "GalNAla"], ["Kdo", "a1-6", "Gal", "a1-6", "GalA"], ["Kdo", "a1-8", "Glc", "b1-6", "Glc"], ["Kdo", "a2-3", "6dTalOAc", "a1-3", "Gal"], ["Kdo", "a2-4", "GalNAc", "a1-5", "Kdo"], ["Kdo", "a2-4", "Kdo", "a1-5", "LDManHep"], ["Kdo", "a2-4", "Kdo", "a2-4", "Kdo"], ["Kdo", "a2-4", "Kdo", "b1-8", "AraN"], ["Kdo", "a2-4", "Neu", "a2-8", "Kdo"], ["Kdo", "a2-5", "Kdo", "a1-4", "Kdo"], ["Kdo", "b2-3", "6dTalOAc", "a1-3", "GlcNAc"], ["Kdo", "b2-6", "Glc", "b1-6", 